examples_prescribed_oscillation/3D_RM6_oscil_surge/T3.75/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(inlet|outlet)"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    atmosphere
    {
        type            totalPressure;
        p0              $internalField;
    }

    bottom
    {
        type            slip;
        //type            fixedFluxPressure;
        //value           $internalField;
    }

    baffle_in
    {
        type            porousBafflePressure;
        patchType       cyclic;
        // In OF        dp = -(D*mu*u+1/2*I*rho*u*u)*L
        D               0.0;
        I               0.0;
        length          0.1;
        uniformJump     true;
        jump            uniform 0;
        value           uniform 0;
    }

    baffle_out
    {
        type            porousBafflePressure;
        patchType       cyclic;
        // In OF        dp = -(D*mu*u+1/2*I*rho*u*u)*L
        D               0.0;
        I               0.0;
        length          0.1;
        uniformJump     true;
        jump            uniform 0;
        value           uniform 0;
    }

    "(object.*)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    "(overset.*)"
    {
        type            overset;
    }
}


// ************************************************************************* //
