examples_prescribed_oscillation/3D_RM6_oscil_surge/T3.75/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default        Gauss linear;
    limitedGrad    cellLimited Gauss linear 1;
}

divSchemes
{
    div(rhoPhi,U)   Gauss upwind;
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    turbulence          Gauss linearUpwind limitedGrad;
    div(phi,k)          $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,epsilon)    $turbulence;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

oversetInterpolation
{
   method           inverseDistance;
   searchBoxDivisions  (100 100 100);
   holeLayers          4;
   useLayer            2;
}

fluxRequired
{
    default         yes;
//    p_rgh;
//    pcorr;
//    alpha.water;
}

wallDist
{
    method          meshWave; //Poisson;
}

oversetInterpolationSuppressed
{
    grad(p_rgh);
    surfaceIntegrate(phiHbyA);
}

// ************************************************************************* //
